app/controllers/comments_controller.rb

SELECT "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "comments" ("created_at", "shot_id", "text", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["created_at", Thu, 13 Sep 2012 23:54:46 UTC +00:00], ["shot_id", 2], ["text", "dasd"], ["updated_at", Thu, 13 Sep 2012 23:54:46 UTC +00:00], ["user_id", nil]]
---
  def create
    @comment = Comment.new(params[:comment])
    shot = Shot.find(params[:shot_id])
    @comment.shot = shot
    @comment.user_id = current_user.id

    respond_to do |format|
      if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 1]]
---
  def destroy
    @comment = Comment.find(params[:id])
    shot = @comment.shot
    @comment.destroy