app/controllers/shots_controller.rb

SELECT "shots".* FROM "shots" JOIN taggings shots_taggings_e7a52ec ON shots_taggings_e7a52ec.taggable_id = shots.id AND shots_taggings_e7a52ec.taggable_type = 'Shot' AND shots_taggings_e7a52ec.tag_id = 10 LIMIT 12 OFFSET 0
SELECT "tags".* FROM "tags" WHERE (lower(name) = 'bcn')
SELECT "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT 1  [["id", 9]]
SELECT "users".* FROM "users" WHERE "users"."id" = 2 LIMIT 1
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = 1
---
  def index
    @title = "recent shots"
    tag = params[:tag]
    user = params[:user]
    like = params[:likes]
    if tag
      @title = "Tag: " + tag
      @shots = Shot.tagged_with(tag).paginate(:page => params[:page], :per_page => 12)
    else
      if user
        @title = User.find(user).name + " shots."
        @shots = Shot.find_all_by_user_id(user).paginate(:page => params[:page], :per_page => 12)
      else
        @shots = Shot.all.paginate(:page => params[:page], :per_page => 12)
      end
    end
    if like
      @title = "This is what " + User.find(user).name + " likes."
      likes = Like.find_all_by_user_id(user)

SELECT "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT 1  [["id", "2"]]
---
  def show
    @shot = Shot.find(params[:id])

INSERT INTO "shots" ("caption", "created_at", "description", "likes", "shot_content_type", "shot_file_name", "shot_file_size", "shot_updated_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @shot = Shot.new(params[:shot])
    @shot.user_id = current_user.id

    respond_to do |format|
      if @shot.save

SELECT "shots".* FROM "shots" WHERE "shots"."id" = 2 LIMIT 1
INSERT INTO "likes" ("created_at", "shot_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 13 Sep 2012 22:16:25 UTC +00:00], ["shot_id", nil], ["updated_at", Thu, 13 Sep 2012 22:16:25 UTC +00:00], ["user_id", 2]]
UPDATE "shots" SET "likes" = 1, "updated_at" = '2012-09-13 22:28:14.542938' WHERE "shots"."id" = 2
---
  def like
    shot = Shot.find(params[:shot_id])
    @like = Like.new()
    @like.shot_id = shot.id
    @like.user_id = current_user.id

    respond_to do |format|
      if @like.save
        shot.likes = shot.likes + 1
        shot.save

SELECT "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = 2 AND "likes"."shot_id" = 1 LIMIT 1
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 7]]
UPDATE "shots" SET "likes" = 8, "updated_at" = '2012-09-13 23:03:16.192950' WHERE "shots"."id" = 1
---
  def dislike
    shot = Shot.find(params[:shot_id])
    @like = Like.find_by_user_id_and_shot_id(current_user, shot.id)
    @like.destroy
    shot.likes = shot.likes - 1
    shot.save

SELECT "shots".* FROM "shots" WHERE "shots"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "shots" SET "updated_at" = '2012-09-14 01:17:57.909836' WHERE "shots"."id" = 3
---
  def add_tag
    tags = params[:tag].split
    shot = Shot.find(params[:shot_id])
    current_user.tag(shot, :with => tags, :on => :tags)
    #shot.tag_list << tags
    shot.save