app/controllers/shots_controller.rb

INSERT INTO "tags" ("name") VALUES (?)  [["name", "bcn"]]
---
  def add_tag
    tags = params[:tag].split
    shot = Shot.find(params[:shot_id])
    shot.tag_list << tags