app/controllers/users_controller.rb

  def index
    authorize! :index, @user, :message => 'Not authorized as an administrator.'
    @users = User.all
---
SELECT "users".* FROM "users"

  def show
    @user = User.find(params[:id])
    @shots = Shot.find_all_by_user_id(@user).paginate(:page => params[:page], :per_page => 12)
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1
SELECT "shots".* FROM "shots" WHERE "shots"."user_id" = 1

  def follow
    following = User.find(params[:following])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def unfollow
    unfollowing = User.find(params[:unfollowing])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1